# vim: set ft=ruby

brew 'git'
brew 'zsh'
brew 'bash'
brew 'fish'
brew 'make'
brew 'cmake'
brew 'openssl'
brew 'coreutils'
brew 'gnu-tar'
brew 'fzf'
brew 'tmux'
brew 'ripgrep'
brew 'direnv'
brew 'wget'
brew 'curl'
brew 'z'
brew 'jq'
brew 'tree'
brew 'gh'
brew 'sqlite3'
brew 'shfmt'
brew 'pgrep'
brew 'pkill'
brew 'neovim'
brew 'atuin'
brew 'btop'
brew 'libyaml'


cask 'brave'
cask 'spotify'
cask 'telegram'
cask 'discord'
cask 'zoom'
cask 'vlc'
cask 'alacritty'
cask 'orbstack'
cask 'discord'


tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-victor-mono-nerd-font"
cask 'font-jetbrains-mono-nerd-font'
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-ibm-plex'
